In [1]:
import pandas as pd

In [2]:
sales_reps = pd.DataFrame({
    "rep_id": [1, 2, 3],
    "name":["Alice","Bob","Charlie"],
    "region": ["North","South","West"]
})

In [3]:
# Sales Data Table(Child)
sales = pd.DataFrame({
    "sale_id": [101, 102, 103, 104],
    "sale_rep_id":[1, 2, None, 4],#Incudes a missing and an unmatched ID
    "sale_amount": [500,1000, 750, 1200]
})

In [4]:
sales_reps

   rep_id     name region
0       1    Alice  North
1       2      Bob  South
2       3  Charlie   West

In [5]:
sales

   sale_id  sale_rep_id  sale_amount
0      101          1.0          500
1      102          2.0         1000
2      103          NaN          750
3      104          4.0         1200

 Outer join

In [6]:
outer_join = pd.merge(
    sales_reps,
    sales,
    left_on="rep_id",
    right_on="sale_rep_id",
    how="outer"
)

In [7]:
outer_join

   rep_id     name region  sale_id  sale_rep_id  sale_amount
0     1.0    Alice  North    101.0          1.0        500.0
1     2.0      Bob  South    102.0          2.0       1000.0
2     3.0  Charlie   West      NaN          NaN          NaN
3     NaN      NaN    NaN    104.0          4.0       1200.0
4     NaN      NaN    NaN    103.0          NaN        750.0

In [8]:
inactive_reps = outer_join[outer_join["sale_id"].isnull()]

In [9]:
inactive_reps

   rep_id     name region  sale_id  sale_rep_id  sale_amount
2     3.0  Charlie   West      NaN          NaN          NaN

In [10]:
outer_join.query("sale_id.isnull()")

   rep_id     name region  sale_id  sale_rep_id  sale_amount
2     3.0  Charlie   West      NaN          NaN          NaN

In [11]:
orphaned_sales = outer_join[outer_join["rep_id"].isnull()]

In [12]:
orphaned_sales

   rep_id name region  sale_id  sale_rep_id  sale_amount
3     NaN  NaN    NaN    104.0          4.0       1200.0
4     NaN  NaN    NaN    103.0          NaN        750.0

In [13]:
outer_join.query("rep_id.isnull()")

   rep_id name region  sale_id  sale_rep_id  sale_amount
3     NaN  NaN    NaN    104.0          4.0       1200.0
4     NaN  NaN    NaN    103.0          NaN        750.0

In [14]:
outer_join.fillna({"name": "Unknown","region": "Unknown","sale_amount": 0},inplace=True)

In [15]:
outer_join

   rep_id     name   region  sale_id  sale_rep_id  sale_amount
0     1.0    Alice    North    101.0          1.0        500.0
1     2.0      Bob    South    102.0          2.0       1000.0
2     3.0  Charlie     West      NaN          NaN          0.0
3     NaN  Unknown  Unknown    104.0          4.0       1200.0
4     NaN  Unknown  Unknown    103.0          NaN        750.0